https://www.kaggle.com/c/titanic

15 April 1912 Titanic gemi kazası ile ilgili veri seti

2224 kişiden 1502 kişi kazada ölmüş (yolcu ve görevli)

titanic.csv içinde

Survival (hayatta kalıp kalmama durumu)--> bağımlı değişken (hedef değişken)
0 = hayatta kalmadı
1 = hayatta kaldı

Bağımsız Değişkenler
1. Sex (cinsiyet)
2. Age  (yaş)
3. SibSp(kardeşler(siblings), karı koca(spouse))
4. Parch (parent, children)
5. Ticket ( bilet numarası)
6. Fare (yolcu ücreti)
7. Cabin(kabin numarası)
8. Embarked(bindiği liman -->  C:Cherbourg, Q: Queenstown, S: Southampton) 
9. Pclass (biletin sınıfı)

In [68]:
import pandas as pd

In [69]:
data = pd.read_csv("titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [70]:
# satır ve sutun sayısı : 891 satır ve 12 sutun
data.shape

(891, 12)

In [71]:
#null değerleri ve suutnların tiplerini öğrenmek için
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

select_dtypes() metodu include parametresi ile kullanılır. İstenen tipteki sutunları getirir.

In [72]:
#sayısal veri tipindeki sutunlar
data_types=["int16","int32","int64","float16","float32","float64"]
numeric=list(data.select_dtypes(include=data_types))  #select_dtypes metodu include parametresi ile kullanılır. istenen tipteki
data=data[numeric]     #parametreleri getirir.
data.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

Feauture Selection(Öznitelik Seçimi) yöntemleri

1. filter metod
2. wapper metod
3. embeded metod

Örneğin : 1000 tane sütunumuz var. Bunların hepsini kullanamayız. Bizim için en yararlı sütunlar hangileri sorusuna cevap için feature selection yapılıyor.

In [73]:
#PassengerId ve Parch sutunlarını sil 
data.drop(columns=["PassengerId","Parch"],inplace=True)  #inplace ile drop edilen son hali kalıcı hale getir.
data.head()

   Survived  Pclass   Age  SibSp     Fare
0         0       3  22.0      1   7.2500
1         1       1  38.0      1  71.2833
2         1       3  26.0      0   7.9250
3         1       1  35.0      1  53.1000
4         0       3  35.0      0   8.0500

In [74]:
data.shape

(891, 5)

In [75]:
#her kolondaki boş (NAN) sayısı
data.isnull().sum()

Survived      0
Pclass        0
Age         177
SibSp         0
Fare          0
dtype: int64

In [76]:
# değerlerin % kaçı boş
data.isnull().mean()

Survived    0.000000
Pclass      0.000000
Age         0.198653
SibSp       0.000000
Fare        0.000000
dtype: float64

In [77]:
import numpy as np
from sklearn.model_selection import train_test_split

# X_train = matris -> büyük harfle,  y_train = vektör -> küçük harfle
X_train, X_test, y_train, y_test = train_test_split(data.drop(columns=["Survived"]), 
                                                    data.Survived, test_size=0.3, random_state=0)
X_train.shape, X_test.shape

((623, 4), (268, 4))

In [78]:
X_train.head()

     Pclass   Age  SibSp     Fare
857       1  51.0      0  26.5500
52        1  49.0      1  76.7292
386       3   1.0      5  46.9000
124       1  54.0      0  77.2875
578       3   NaN      1  14.4583

In [88]:
null_columns=[]

def findNullColumns(df):
    global null_columns
    null_columns=[]
    for col in df.columns:
        col_sum=df[col].isnull().sum()
        if col_sum!=0:
            null_columns.append(col)

In [91]:
findNullColumns(X_train)

In [92]:
null_columns

['Age']

In [93]:
def fillNullColumns(df):
    for var in null_columns:
        median = df[var].median()
        df[var+"_median"]=df[var].fillna(median)
        df[var+"_zero"]=df[var].fillna(0)

In [94]:
fillNullColumns(X_train)

In [95]:
X_train.head()

     Pclass   Age  SibSp     Fare  Age_median  Age_zero
857       1  51.0      0  26.5500        51.0      51.0
52        1  49.0      1  76.7292        49.0      49.0
386       3   1.0      5  46.9000         1.0       1.0
124       1  54.0      0  77.2875        54.0      54.0
578       3   NaN      1  14.4583        29.0       0.0